{
    "0": [
        [
            "The paper first talks about the current state of learning machine learning and the challenges software engineers face when learning machine learning",
            "The authors suggest hyperparameter tuning,  data splitting, and gradient signals are the main topics to learn.",
            "Authors designed specific exercises to help students learn hyperparameter tuning, data splitting, and gradient signals.",
            "Specific exercises can be used not just for software engineers, but for anyone with an engineering or quantitative background.",
            "Explanations of the exercises and what they provide to students are clear.",
            "The entire paper is based on the observation \"We noted that especially computer science and software engineering students tended to struggle with the adoption of an empirical mindset rather than a constructive one.\" While it sounds reasonable, there are no additional examples or details explaining how software engineers struggle or why.",
            "It's not clear how the authors chose hyperparameter tuning,  data splitting, and gradient signals as the main topics",
            "There's no quantitative difference provided showing the effectiveness of the results provided",
            "It would have been even nicer if there was a way to compare it to existing teaching methods.",
            "The authors of this submission identified three major attention points of ML teaching when introducing the topic to software engineering students",
            "Those principles are taught with the help of self created jupyter notebooks, providing an interactive widget for a simple linear regression problem for visualizing the effect of different learning rates, the proper use of data splitting for hyperparameter tuning and an example implementation of automatic differentiation.",
            "This identifies areas which probably need to be addressed better in future design of teaching materials.",
            "Also, the authors invested great efforts in the very readable design of small toy classes showing how backpropagation via autodiff can be implemented",
            "I assume this will be of great value for understanding the working principles of large frameworks like pytorch or tensorflow, especially for software engineering students.",
            "On the other hand, I think that such a code-heavy approach might not be directly transferable to different audiences which might be less familiar with programming or software design.",
            "Moreover, even though I agree that using jupyter notebooks has become a frequently used and pretty much standard way for teaching and demonstration within the data science community, I doubt that the authors used it as their only means of teaching in ML classes and they could have elaborated a bit on how they encapsulate their notebooks into their regular teaching",
            "But maybe that had to be left out due to paper space restrictions.",
            "This work focuses on teaching Machine Learning (ML) to Software Engineers (SE)",
            "There is a need for change of thought process between SE and ML due to constructive and empirical mindset",
            "Authors specifically focused on three aspects of ML, namely, 1",
            "To address these challenges, authors created materials which explains the underlying concepts and how they differ from SE",
            "* Materials are self-explanatory and useful for all students over and beyond SE students",
            "* Motivation on each material is well thought out and described very succinctly",
            "* Small suggestion: Resolution of Fig",
            "Generating the figures in either “pdf” or “eps” format might retain the figure quality",
            "This paper presents a web application for learning decision trees (referred to as DTs throughout the paper) as well as their nuances",
            "The authors do an excellent job situating why learning decision trees is important",
            "Similar if the intended audience has a background in computer science, how does this tool use and/or enhance one's computer science training? ",
            "Additionally, I would have liked to see a connection to how this tool fits into a machine learning course",
            "For example, is this a student's first or second contact with the material? Do students use this tool to inform pseudocode drafts? ",
            "I can see the potential of the tool introduced here to teach and explain the very basics of decision trees (and how to evaluate classifiers).",
            "I'm not sure it is entirely finished -- the \"Hint\" functionality did not do anything, as far as I could make out, and best practice for UI design for this kind of interactive tutorial would be to have documentation in the form of tooltips right inside the app.",
            "How to find optimal *binary* splits is much easier to explain/understand and the resulting tree structures are easier to follow as well",
            "This tool only aids in the visual explanation of very simple decision tree topics, which, in my teaching experience, only rarely cause confusion or issues in the classroom, namely the basic \"greedy\" recursive split search and how to use the tree to classify new data",
            "This seems like a wasted opportunity and limits the utility of the proposed tool-- more challenging and practically very important topics that learners often struggle with in my experience, like, e.g., pruning trees to avoid overfitting, how surrogate splits work, the instability of tree structure to small data perturbations,  etc, are not covered by the functionality of the tool.",
            "This tool is not based on any of the popular ML frameworks in R or Python, which seems another wasted teachingg opportunity",
            "If it were, this would allow students to also see the code generating the respective model and thereby learn to relate theoretical concepts to the corresponding implementation features.",
            "The authors explain their motivations, demonstrate a societal need for a solution, and also showcase previous methods used like class of clans.",
            "For example, the authors believe the original Iris dataset was created with benchmarking in mind, not learning",
            "The episodes and intended learning outcomes section is also well organized into specific topics",
            "The topics themselves are also good introductory topics for teaching machine learning.",
            "While that's important to include, I would have preferred to see the outcomes of using such a teaching method",
            "The authors present a self designed introductory teaching lesson of about 3 to 4 hours to convey the principles and workings of some of the fundamental aspects of ML: feature engineering,",
            "KNN and logistic regression as classification methods and performance evaluation in a playful manner using chocolate and candy as a practical toy dataset and additional motivator.",
            "Their approach follows the guidelines of the Carpentries and aims to develop intuition for ML, bridging the gap between the two most dominant ML teaching styles which either are primarily focussed on",
            "theory and might provide a daunting entry barrier on the one hand, or aim at quick implementation and application of ML algorithms without detailed knowledge of the inner workings on the other hand.",
            "Also, the authors put strong focus early on to discuss ethical issues of machine learning and encourage lesson participants to think critically about adoption of ML approaches for given problems which is a strong plus in my opinion and often not emphasized enough in existing tutorials.",
            "I would be very curious to learn how lesson participants respond to this approach",
            "Unfortunately, the authors only present their teaching procedure without giving details on how well their approach worked in practice (however that could be measured...), how participants",
            "Unfortunately, author identification became possible through that and the review can no longer be considered completely \"blind\".",
            "Nevertheless, I suggest accepting the submission since the approach is innovative and will probably invoke interesting discussions among participants.",
            "This work addresses the middle ground between math-heavy foundational and application-focused black-box Machine Learning (ML) teaching styles",
            "Authors proposed a fun active learning strategy to understand ML concepts and ethical decision processes using candies",
            "Authors found their strategy to be useful for not only for undergraduates but individuals from all ages.",
            "* Very well-motivated paper, there is clearly a need for this kind of teaching style to democratize ML",
            "* Proposed strategies along with the learning outcomes are thoughtful and effective",
            "* Prerecorded data is made available with support for the virtual format",
            "* Authors mentioned the strategy was effective across all ages",
            "The authors describe very well the motivation to apply machine learning technology to the collected knowledge of the libraries",
            "The idea to spark interest in non-technical staff by teaching them programming and machine learning topics is appealing",
            "However, the question remains if this approach is beneficial in the long term as there is a steep learning curve for beginners to develop correct and working AI projects",
            "These aspects are useful for AI experts teaching this topic and could improve the experience for all kinds of learners",
            "The collected qualitative feedback is interesting and helpful to improve the content of the training",
            "Yet quantitative data would also be interesting to answer questions",
            "For example, if the training attendees could apply the new knowledge in their daily work",
            "Typo Line 185, Row 2 \"a conversation group conversation\"",
            "The paper summaries the authors' findings on introducing staff of academic libraries to AI",
            "This problem is, in many ways, domain specific as many obvious applications of AI can be identified in advance (as opposed to designing a curriculum for CS students which cannot make such assumptions)",
            "The authors present findings from two training experiences aimed at beginners in two different venues.",
            "However, the number of participants (and their backgrounds) would help place this better in context.",
            "The experience with the local AI groups likewise seems to have built positively on top of a general introduction to AI",
            "This, in itself, is hardly surprising; it would be more interesting to see the medium- and long-term effects of these trainings",
            "For instance, interviews with course participants some months down the line to see if they were able to incorporate some of the introduced topics into their daily workflows or whether they were able to follow through on the collaborative projects mentioned by them",
            "I would also encourage the authors to consider metrics that can be used to quantify the results of their experiments in a data-driven way that goes beyond qualitative results.",
            "The paper discusses how to teach AI in the context of libraries",
            "It discusses two trainings that were implemented and evaluate what learners thought about the courses and what the take aways are from the learner's feedback.",
            "I will aim to focus my teaching \"around the uses, benefits, an potential harms of the technology\", as the authors suggest.",
            "- Section 1, line 033: \"(Boyd & Crawford, 2012)\" -> \"Boyd & Crawford, 2012\"",
            "This paper describes the curriculum of an introductory ML course given to non-STEM students at a Spanish higher education school",
            "This course is embedded in a double degree program where graduate courses are offered that mix law, business and engineering",
            "The later lessons of the course then introduce more advanced model architectures like MLPs and SVMs",
            "If I understood correctly, the course is subsequent to a basic introduction to R and python",
            "What I like about this curriculum, is the focus on a simple linear regression approach to introduce students",
            "Tying the core concepts of machine learning to this, appears to me like a splendid idea as it removes the complex math of say SVMs, MLPs et al from the teaching",
            "This way, learners can focus on understanding supervised learning",
            "Further, I like the idea of discussing this regression problem on a data set the learners can relate to",
            "In this case, it is to predict the weight given the height and gender",
            "This direct relation of the prediction to real world observations appears to be a strong bridge and the basis for content uptake",
            "On a second thought, any discriminatory aspects of the trained model could directly be discussed based on this fiducial analysis",
            "This shows, what a versatile vehicle this data set and prediction task can be",
            "These two aspects are the 2 main outstanding strengths of the article.",
            "There are a couple of things, I'd like to stress which I hope can help the author(s) to improve the paper content (potentially for the presentation at the workshop on Sep 14):",
            "line 30 (right column) \"First contact of these students with Business Analytics is a 30 hours introductory course during the third semester.\": It might be a good idea to set up learner profiles to illustrate the background knowledge of the participating students and (even more importantly) the goals of the students",
            "- page 2, line 103 (left column) \"We have a set of vectors X ...\": this appears to be a bit inconsistent to me, figure 1 discusses $y = f(x_1, ..., x_n)$ but the text talks about $X$ (capital) as the entire set",
            "It would be nice to have consistent variable naming, so that the text is aligned to the figures.",
            "The following paragraph \"The example may sound a bit absurd ...\" for me is unable to fix the confusion about the synthetic over-fitting example",
            "- page 3, line 111 (left) \"L’Oréal's Rule to choose the optimal slope (Because I'm worth it)\" I didn't get this metaphor at all.",
            "- page 3, line 113 (left) \"Then we attack the non-linear separable classification of virginica versus versicolor to stress the idea",
            "- page 3, line 119 (left): \"The confusion matrix is well understood with the boy who cried wolf example of Type-I error.\" It's unclear to me what the 'boy who cried wolf example' is",
            "- page 3, line 152 (left): \"The minus sign and $log_2 (p_i )$ are the most feared beasts.\" it is unclear what this means"
        ]
    ]
}