{
    "0": [
        [
            "* line 487: \"We\" -> \"we\"",
            "* line 56: \"We\" -> \"we\"",
            "- Approach is original and interesting",
            "* line 144: \"association\" -> \"associated\"",
            "- line 402: is there alpha missing before z_1? ",
            "  as full-scale assistance seems wrong",
            "* line 283: \"choice\" -> \"choose\"",
            "* line 437: \"firrst\" -> \"first\"",
            "CryoGAN) seems to be a very powerful and flexible method",
            "* line 420: \"menbranes\" -> \"membranes\"",
            "- There is no quantitative comparison of annotation time of conventional methods versus their method",
            "What implementation did you use for the CAM attention module?",
            "Are there really no available software implementations of other methods to compare with?",
            "* line 335: \"decrease if\" -> \"decrease in\"",
            "The introduction of dynamic image and attention module is novel",
            "Shape context descriptors are used to represent different nuclei",
            "electron microscopy dataset of neural tissue, experiments demonstrate",
            "•\tdetecting boundaries of nuclei in ROIs, ",
            "Line 400: \"around an hour and a half on an average\"",
            "- Provides strong theoretical foundation of the method",
            "Why was that specific initialization chosen?",
            "- Description of latent code -> conformation manifold could be made clearer ",
            "Lines 314, 345-350: It is not clear how delta is computed",
            "* lack of discussion in related work and experimental results",
            "There are thus still some unclear parts about how the method actually works:",
            "* title: capitalize \"image\" and \"classification\"",
            "Cell tracking is an important but challenging step for many biological research",
            "This is an important problem in developmental biology which has not yet received sufficient attention from the computer vision community",
            "\"combined with Ben Graham’s [2] pre-procesing method of subtracting the local average colour\"",
            "•\tapplying a medial axis transform (MAT) to nuclei, ",
            "The results demonstrate consistent improvements over several baselines and",
            "But they observe that self-supervised methods typically produce high-frequency artifacts and achieve inferior results compared to supervised methods",
            "Lines 249 – 257: The authors refer to patches and then to images",
            "High-quality semantic segmentation is an undoubtedly significant and impactful challenge for microscopy",
            "(although already explored in other medical domains)",
            "There is a little confusion with regard to the advantages of this approach compared to related works",
            "Line 171: why did you choose three activation functions and 1x1 convolutional kernels? ",
            "To be more precise, Eq 3 computes simply an averaged image using fixed weights \\alpha_t",
            "The technical description of the method is very clear and the provided figures",
            "* thorough comparison to baselines and model variations",
            "  model for lesion Detection, tagging, and segmentation.",
            "Some sentences use vague or colloquial language:",
            "* Significant increase in segmentation performance achieved with this method",
            "The joint loss is a weighted contribution of denoising and segmentation loss contributions",
            "•\tdefining 20 features derived from MAT-based skeletons, and ",
            "The pre-processing combines CLAHE and Ben Graham's algorithm",
            "In line 140 'd' is used as the dimension of a feature vector",
            "I am not sure what this could look like in a clinical setting and suggest",
            "Also the technical parts are not leaving me with total clarity",
            "All code and data is available",
            "would appreciate if the authors could discuss this point in more detail to",
            "This paper is well written and the presentation is easy to follow",
            "Reusing the output of a U-Net for a second round of processing is not an",
            "extractors, which are enabled by the 2D input images",
            "Performance is evaluated on three public data sets.",
            "Line 263 & 285: \"In this the image\" → In this image",
            "The authors propose an approach for the segmentation of retinal vessels",
            "The authors mention that \"there is potential for mobile applications\" (line",
            "  - “and a kind of Midas touch problem [10] remains” (a kind)",
            "The task can be divided into two registration problems: registration between static samples and between static and time-lapse imaging",
            "- The method is not described in full detail or it is difficult to understand",
            "It is tricky to make the entire quantitative comparison hinge on a single measure that is known to be questionable",
            "* evaluated on only one dataset",
            "* The performance of the method is generally good",
            "of the U-Net for a second round of processing",
            "* convincing improvements on several datasets",
            "The main contribution here is therefore the addition of an attention mechanism",
            "* In the experiments only Gaussian noise is used",
            "The classification results (different stages of cancer) from the first phase are reused to enhance the instance segmentation in a second phase",
            "The sampled densities  together with a forward model produce synthetic 2D tomographic projections which are together with real 2D projection are used to train a discriminator/critic as part of a Wasserstein GAN like approach",
            "- what would be if orientations are not uniformly distributed on SO3? Would the reconstruction simply be worse?",
            "From the GitHub repo of the paper:",
            "This paper focuses on a longstanding problem in medical image analysis: retinal vessel segmentation",
            "Another assumption is that the very few ground truth segmentation masks must be representative of the dataset",
            "- Section 3.2 combines two well-known preprocessing methods (CLAHE and average color subtraction) and performs well-known data augmentation approaches.",
            "and show qualitative results of the dynamic image generation.",
            "The proposed method is compared to strong baselines, outperforming them on real and simulated data",
            "of the second round of processing.",
            "The motivation for the work comes from automating the classification task for assigning labels such as cognitive unimpaired (CU) and Alzheimer’s disease (AD) to each patient based on the 3D MRI volume",
            "the four additional classes listed in lines 163-164); this is not discussed",
            "consistent improvements of the self-attention version of the proposed method",
            "Setting aside the paper by Kobayashi et al, this paper displays interesting conceptual novelty",
            "model trains faster and requires less resources for prediction.",
            "The method for preparing training data based on the available BreCaHAD dataset is very creative",
            "Takes an hour and a half on average",
            "The paper is generally well written and easy to follow",
            "The observation that their method is faster in tracking cells than conventional methods is based on the user’s opinion",
            "fine-tuned) feature extractor, an attention module, and subsequent fully",
            "2 there appears to be some structural discrepancies in the ‘Flywing’ data",
            "- The manuscript is well written with details that are necessary, the limitations are clearly stated",
            "- In Section 2 many methods are discussed but the comparison in Figure 2 is limited to only N2V (and a variant)",
            "In line 143 it is itself a feature vector.",
            "Is there any problems to expect when switching to real data (and the associated noise sources)?",
            "The novelty of the proposed method is somewhat limited",
            "dataset) and addresses key questions about the proposed method",
            "- \"It is determined by pathologists on Hematoxylin and Eosin (H&E) stained tissue specimens.\"",
            "All the consequent modifications are being made",
            "  in clinical seems wrong",
            "This paper presents a method for Alzheimer's Disease (AD) classification from",
            "* Excellent technical rigour demonstrated in investigating novel method through ablation studies"
        ]
    ]
}