{
    "0": [
        [
            "For instance, (a) How often the Algorithm 2 will be executed and conduct RPO? (b) How will PRO be integrated into the real-time schedulers? (c) What are the criteria that trigger the new budget and periods?",
            "For example when reconfiguration happens every second, lasts 250ms (a quarter of a second) and blocks the overlapping requests it doesn't affect IQR (a function from p75) but delays the requests by 850% (from 0.29ms to 250ms).",
            "To illustrate, the first paragraph in Section 3 says, “Using two rate adaptation algorithms, …” — which two algorithms? Where is the explanation for red/green shades in Figures 1b and 1c? Where can I find an explanation for the difference between 1c and 1d (is there any reference for 1d?)? I am not sure what is a bitrate track here; is it the same as a resolution? ",
            "It can help researchers determine the number of runs, duration of runs, etc",
            "    - Is watermarking the same as pipelining? In PBFT, watermarking functions as a pipelining optimization",
            "However, the evolution of CWND can be much more complex on real cellular networks",
            "“The main idea behind CoPi is to get rid of the unnecessary delay and message losses in a pipeline, and consequently avoiding the timing and data dependencies between the communicating tasks [21].”, “As CoPi meets the E2E delay and loss-rate guarantees of a pipeline, the tasks are asynchronously scheduled without any timing or data dependencies between each other.” ",
            "The \"Paxos Made Simple\" paper introduced three logical roles in Paxos: proposers, acceptors, and learners",
            "For example, given that convergence test does not always apply, oftentimes it’s still hard to know how long a run should be, e.g., for video streaming experiments what should be the total streaming duration in order to compare QoE for different streaming systems/algorithms? The paper uses long-term throughput as an example for congestion control evaluation, but sometimes we need to consider the impact of start-up time, say for short-lived flows/web pages",
            "* Can TriScale be used with metrics that need a distributed view? For example, maximum queue length encountered by a packet on its path within a data center.",
            "TriScale is most useful in guiding networking researchers to design scientifically sound experiments, such as how long each run should be based on the convergence test, how many runs / series of runs to perform before meeting a specific confidence level, and the time span of a series of runs hinted by the network profiling",
            "Empirical results have shown that TCP exhibits drastically different behavior on different operators' networks, e.g., the bufferbloat problem is less prominent sometimes, which might invalidate ALCC or negate the performance gains of ALCC",
            "PBFT does not force clients to send only one request at a time, and clients do add timestamps to each request",
            "Thus, during the design stage we expect the model to hit XYZ queries/s, we would like it to hit a similar QPS of XYZ in production setting, and it will be highly desirable to capture the runtime performance aspect of ML training;",
            "For each task in the (linear) execution order, new computation times and periods are derived for data-independent periodic subtasks that can be scheduled under traditional RM, so as to guarantee end-to-end delays and acceptable loss rates",
            "- Augmentation: A naive baseline can be adding one or more additional tracks to the bitrate ladder, which can be used to evaluate Segue's effectiveness and savings (for not encoding and storing the extra tracks)",
            "How do future research challenges compare to existing SoK papers? e.g., Eyk et al",
            "In section 6.1 dealing with migration overhead and table 5, it doesn’t seem like the cost of migrations is reflected anywhere in the scheduling algorithm, only that task migrations can be kept low with the proposed approach.",
            "By separating the dependency requirement, it presents two interesting concepts tension avoidance and tension resolution.",
            "- \" While many successor BFT protocols eliminated watermarks in favor of batching (e.g, [13, 16, 39])\"",
            "* At the beginning of Section 3.2, it was unclear whether loss rate refers to only messages that are input to the source task, or to all tasks.",
            "  premium? The numbers from ccp were reported at 10 gbit/s, showing an",
            "More specifically, the paper shows that chunks with complex scenes require higher bit rates and are more vulnerable to QoE degradations (e.g., rebuffering)",
            "It mostly focuses on bitrate/frame-rate adaptation rather than segmentation adaptation",
            "This is feasible due to the observation that TCP's congestion window is kept unnecessarily large on cellular networks, allowing ALCC the latitude to operate at a lower effective congestion window (or sending rate) than the underlying TCP",
            "Additionally, the pipelines may also have constraints on the end-to-end sampling rates, which determine the quality of service provided",
            "Also fig 1(bcd) could use another set of colors than fig 1a, to avoid establishing wrong mappings at readers’ first glance.",
            "Does your solution resemble the following thought experiment, and how is it different if so? Suppose we simply run X concurrent instances of PBFT among the same N nodes, and each instance `i` of PBFT writes its client requests in a specific log (no execution of client requests, just log them in a database/file), then a separate process would merge these log files deterministically, in the same manner at all N nodes?",
            "In simulation, the heuristic approach, called CoPi, outperforms MINLP solvers.",
            "When a failure-free execution starts observing simple failures, message delays or loss, even if a replica has sufficient number of Prepare messages, it will continue waiting until timeout for Prepare from the selected f+1 replicas to arrive",
            "E.g., if an algorithm were informed a 10% random packet loss beforehand (on a link with infinite bandwidth), then it could leverage FEC and send 10% extra redundancy packets to maintain a high goodput",
            "For example, the paper mentions that the convergence test does not hold while measuring energy consumption since it is cumulative over time, and hence, one should measure power draw instead",
            "The authors mention that “Given the user’s objectives (e.g., the KPIs to analyze and the confidence levels to reach), TriScale helps answer questions...”, but it's still not very clear how to define the KPIs and choose the confidence level, e.g., should I choose mean, median, or some percentile? The paper also says “for each performance dimension, the user defines a metric together with its convergence requirements, a KPI, and a variability score”, but sometimes a user may not know how to best define them",
            "While prior works have proposed to use constraint solvers to come up with a satisfiable task schedule, these are slow, especially when the workload changes at runtime and new schedules are desired at runtime, This paper proposes a heuristic-based algorithm instead — CoPi — that maps the pipeline to independent tasks and data buffers, and uses rate-monotonic scheduling to come up with a set of feasible schedule",
            "For instance, if the problem is NP-hard, the traditional solvers may break in certain conditions — the authors could analytically or experimentally show the efficacy of CoPi for such cases",
            "Then, Donut Paxos can be motivated more strongly.",
            "Such variations may be difficult to understand for a reader who is not well-versed with the working of both the PBFT variants.",
            "It formulates the relevant optimization problem and uses simulation-based experiments to quantify QoE improvements for different videos and network conditions",
            "“As Equation 1 is a recursive equation, the computation time depends on the wanted precision on E.” Why is the equation recursive? Is it because Ri’s are unknown? The LHS E does not feature on the RHS.",
            "        + explore: \"explore deploying various machine learning applications using serverless platforms\" and \"explored to deploy stream processing applications\"",
            "Epoch leaders, \"i adds itself to the leader set of epoch e′ and removes one node (not itself) for each epoch between e and e′\"",
            "But those models aren't applicable to the multi-leader case: it lacks the leader/follower roles and local reads lead not only to staleness but to observing incompatible histories too caused by the reordering of the commuting commands.",
            "Even for the case when Paxos-like consensus protocol is used for main applications, replacing a failed server can be handled by the network layer (e.g., updating DNS to redirect requests to a new server)",
            "Therefore, TriScale could potentially help avoid design mistakes and also significantly foster reproducible studies.",
            "Paper summary: Embedded applications consists of one or more sensor-to-actuation pipelines, e.g., object perception pipelines in autonomous vehicle systems",
            "Or simple horizontal Paxos-like approach may work fine",
            "Although the aim of this paper is not to evaluate performance of multi-leader protocols, graphs that illustrate the performance of the proposed variants can help understand various design choices, such as which scheme is better Tension Avoidance or Tension Resolution.",
            "- When describing Fast Paxos, the authors use proposals, acceptors, and learners; but in Simple or Fast PPaxos, the authors use proposals, acceptors, and replicas",
            "- Reduction of utilization for already accepted task pipelines when mapping to multi-processor fails is a tradeoff between end-to-end delay and utilization",
            "In addition, it could use more structure (i.e., paragraph labels) to make the topics tackled easier to follow.",
            "- Besides stochastic packet losses, what are the other scenarios (e.g., high-speed networks?) when ALCC-based CC differs from the native implementation? For these scenarios, give evidence to explain the unusual behavior, such as why ALCC-based Verus in Figure 13 achieves higher throughput than Verus between 100-150 seconds",
            "p13: Cost and performance benefits of serverless have been repeatedly discussed before so I suggest removing this sentence: \"We believe that in addition to performance, serverless com- puting also offers a unique pricing model, and as discussed in Section 4, serverless computing can be cost-effective for certain demand.\"",
            "This assumption may not always hold in practice, e.g., Cubic significantly reduces the congestion window due to small switch buffer and non-congestion packet losses (e.g., bit errors, failures)",
            "Next, authors gradually lay down the design of existing multi-leader protocols by presenting four of their variants: Simple PPaxos, Fast PPaxos, Unanimous PPaxos, and Majority Commit PPaxos",
            "For example: \"Can legacy code be made to run serverless?\" is closely related to Section 6.2 in this paper on \"Decomposing Serverless Applications\".",
            "While they don't mention water marking explicitly, some avoid watermarking ([16]) while some do use pipelining, e.g., [13] (which I understand to be similar to watermarking)",
            "The key advantage of adopting multi-leader protocols is that they facilitate out-of-order execution of commutating",
            "- Segmentation: Prior work [9, 29, 33] is considered orthogonal to Segue, but what if merging two fragments into a chunk and converting the second keyframe as an inter-frame actually improves the coding efficiency? This will apparently lead to strictly better results (same chunk length with a smaller size) and would reduce (and improve) Segue to the same domain as prior work.",
            "It also poses some open research challenges in the area and proposes high-level solutions.",
            "A subsequent [blog](https://netflixtechblog.com/optimized-shot-based-encodes-now-streaming-4b9464204830) further introduced \"shot collation\" that merges multiple shots into a single chunk, bearing the same spirit as Segue (for a purpose different from QoE optimization though).",
            "Duplicates make sense when there is a higher-level abstraction, e.g., commands (like in an SMR) or transactions (like in a UTXO model), and in that case you could say that two inputs to the service are duplicates",
            "It further argues that using variable-length chunks (segmentation) and more bit rates for complex scenes (augmentation) provides more knobs to optimize user QoE",
            "This will impose requirements on the end-to-end latency, but unfortunately it also imposes constraints and requirements on the period values.",
            "Also, Donut Paxos/MultiPaxos uses vertical reconfiguration instead of the classical horizontal configuration that is used in Paxos",
            "The paper also shows how these variants can be mapped to existing protocols like Basic Epaxos, Atlas, and so on.",
            "    Also, migration to QUIC on mobile client is doable without",
            "CoPi is evaluated against open-source constraint solvers like GEKKO, pyomo, and scipy using pipelines with synthetic parameters",
            "Some services can have more than one ABR algo deployed, each for a specific platform (e.g., web v.s",
            "Why can't these steps be combined? Further, to reduce from 2f+1 to 2f, the Basic Epaxos optimization requires more network communication--from proposer to all acceptors and then acknowledgments from acceptors to the proposer",
            "* “CoPi takes the initial task runtime budgets (C in the model and budgets in Algorithm 1) and the desired upper bound on the end-to-end delay (EUB in the model and e2e_ub in Algorithm 1) as its inputs.” What about the upper bound on the loss rate?",
            "This is different and the term $T_1$ is therefore not needed (it refers to the fact that an event may happen precisely at the time of the start of $\\tau_1$ and not be detected at the start, hence the event would only be detected and correctly reacted upon with the following job of $\\tau_1$).",
            "As for augmentation, this paper also mentioned the \"per-title encode optimization\" technique shipped by Netflix years ago, so the only differentiator of Segue on this front is selectively augmenting parts of a video, which sounds like more of a marginal revision than a new \"direction\" or \"thread.\" In fact, Segue's unique dependence on playback context and ABR algorithm only manifests through basic simulation.",
            "* In Section 3.1, the authors talk about how serverless platforms use \"approaches [that] employ container reuse, loose isolation between function instances, and memory snapshotting and restoring to achieve a cold-start latency that is as low as 10 ms or less.\" Here, the authors are missing approaches related to placement/routing/scheduling that are also used to achieve low cold-start latency (by increasing locality and thus maximizing environment re-use or benefiting from caching, in combination with placement/routing/scheduling algorithms)",
            "The paper shows that three CC protocols (Verus, Copa, and Sprout) achieve similar performance with and without ALCC, using repetitive experiments and figures",
            "Parameters of ABR algorithms may often be tuned given",
            "than buffer-based algorithms for the traces considered in",
            "p13: \"To the best of our knowledge, we did not come across any previous work that suggests decomposing monolithic serverless applications to optimize the cost or performance.\" => Related work published in IEEE Software: Ristov et al",
            "- Section 2 says that messages can be dropped, and indeed Section 6.3  considers a situation that messages to d3, d4, d5 are dropped",
            "- The disadvantage of scaling the period and adjusting the computation time can lead to increased memory requirements of buffers between tasks, the overhead of which is not presented",
            "Also, the experiments do not highlight any benefits for Donut MultiPaxos over MultiPaxos in terms of throughput and latency",
            "One of the interesting implications of this approach is that it helps to get rid of the control messages which often looks like gaps to an application which uses consensus as a foundation for the  replicated log service.",
            "- It is better to include an experiment to illustrate that when there is no bufferbloat, ALCC's approach may not attain superior performance, which necessitates the setting of bufferbloat or cellular networks.",
            "However, Theorem 5.4 in [20] specifies that the quantity bounded is the reaction time and not the worst-case end-to-end delay (as used in the paper)",
            "In the case any leader fails or acts malicious, SRB switches to the new epoch with a new primary leading the epoch and determining the next set of leaders.",
            "For instance, the ramp-up time of LEDBAT's throughput would also depend on the bandwidth -- Does it mean that for each network profile, researchers have to increase the runtime repeatedly until the convergence test is passed?",
            "        - Adzic and Chatley 2017: \"Serverless Computing: Economic and Architectural Impact\"",
            "- Plot how the underlying TCP CWND varies over time along with each cellular CC scheme's CWND (if available; plot sending rate otherwise)",
            "        + can: \"serverless computing can be employed to solve various mathematical and optimization problems\"",
            "Both aspects that constitute Segue -- segmentation and augmentation -- have been studied before, with the prominent effort originating from Netflix and in the industry as engineering innovations.",
            "Further, the paper includes a set of failure scenarios, which have been explored well during experimentation.",
            "- Since ALCC controls the deliver of packets at the application layer, introducing such a new queue at the application layer might increase the end-to-end delay",
            "These pipelines are typically modelled as multiple data-dependent tasks (or processes)",
            "In specific, if two commands do not conflict, then these protocols allow replicas to execute them in their desired order",
            "Besides, the authors did a better job in their replies explaining the interactions between ALCC and the underlying TCP than the paper does; more experiments to break down the impact are required to support these interaction claims regardless.",
            "What type of real-time schedulers can tolerate 60 ms of delays at runtime? How will this significant overhead be feasible in embedded devices while retaining real-time guarantees if the scheduler needs to execute Algorithm 2 quite often to conduct RPO? In contrast, if RPO is not needed, traditional optimization solvers' timing overhead is not a problem",
            "Similarly, although prior work [22, 31] pursues the opposite of Segue, they simply navigate the same tradeoff space by being more generous on the number of tracks, and can also serve as baselines.",
            "In the evaluation, this paper demonstrates that porting three well-known CC protocols -- Verus, Copa, and Sprout -- to ALCC requires little effort, while it is possible to maintain comparable performance as their native implementations at the same time.",
            "Regarding segmentation, Netflix documented a method called \"per-shot encode optimization,\" as mentioned in Section 2.2",
            "Then, ai records v as chosen and sends back to pi",
            "For dynamic pipelines, it also does - (a) runtime task migration  and (b)scheduling parameter optimization"
        ]
    ]
}